<?php
namespace Common\Server;

/*
+----------------------------------------------------------
* 通知公告类
+----------------------------------------------------------
*/
class NoticeServer
{
    /**
    +----------------------------------------------------------
    * 获取我浏览过的通知公告
    +----------------------------------------------------------
    * @ author chenfeng
    +----------------------------------------------------------
    * @ date 2016-10-21
    +----------------------------------------------------------
    */
    public function get_myLook()
    {
        $log = D('NoticeLog');
        $where = array();
        $where['uid'] = A('Member','Server')->get_user_uid();
        $return = $log->where($where)->select();
        return $return ? get_rows_by_array($return,'id') : array();
    }
    
    /**
    +----------------------------------------------------------
    * 获取通知公告详情
    +----------------------------------------------------------
    *  @param  int $id 活动ID
    +----------------------------------------------------------
    * @ author chenfeng
    +----------------------------------------------------------
    * @ date 2016-10-25
    +----------------------------------------------------------
    */
    public function get_info_by_id($id)
    {
        if(!$id || !is_numeric($id)){
            return false;
        }else{
            $return = D('Notice')->where(array('id'=>$id))->find();
            return $return ? $return : array();
        }
    }
    
}