<?php
namespace Common\Server;

/*
+----------------------------------------------------------
* 备案类
+----------------------------------------------------------
*/
class RecordServer
{
    /**
    +----------------------------------------------------------
    * 获取我的备案信息
    +----------------------------------------------------------
    * @ author chenfeng
    +----------------------------------------------------------
    * @ date 2016-10-21
    +----------------------------------------------------------
    */
    public function get_myRecord()
    {
        $record = D('Record');
        $where = array();
        $where['uid'] = A('Member','Server')->get_user_uid();
        $return = $record->where($where)->select();
        return $return ? $return : array();
    }
    
    /**
    +----------------------------------------------------------
    * 获取备案详情
    +----------------------------------------------------------
    *  @param  int $id 活动ID
    +----------------------------------------------------------
    * @ author chenfeng
    +----------------------------------------------------------
    * @ date 2016-10-25
    +----------------------------------------------------------
    */
    public function get_info_by_id($id)
    {
        if(!$id || !is_numeric($id)){
            return false;
        }else{
            $return = D('Record')->where(array('uid'=>$id))->find();
            return $return ? $return : array();
        }
    }
    
}