<?php
namespace Common\Server;

/*
+----------------------------------------------------------
* 系统配置类
+----------------------------------------------------------
*/
class SettingServer
{
    /**
    +----------------------------------------------------------
    * 获取系统配置
    +----------------------------------------------------------
    * @ author chenfeng
    +----------------------------------------------------------
    * @ date 2016-10-21
    +----------------------------------------------------------
    */
    public function get_config()
    {
        $setting = D('Setting');
        $return = $setting->field('keyname,keyvalue')->select();
        return $return ? get_array_by_key($return,'keyname','keyvalue') : array();
    }
    
}